# Wine

### Introduction:

This exercise is a adaptation from the UCI Wine dataset.
The only pupose is to practice deleting data with pandas.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data).

### Step 3. Assign it to a variable called wine

In [2]:
data = 'https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data'

wine_df = pd.read_csv(data)

wine_df.head()

,1,14.23,1.71,2.43,15.6,127,2.8,3.06,.28,2.29,5.64,1.04,3.92,1065
0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
1,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
2,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
3,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
4,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6.75,1.05,2.85,1450

### Step 4. Delete the first, fourth, seventh, nineth, eleventh, thirteenth and fourteenth columns

In [24]:
# del wine_df.iloc[:, [0, 3, 6, 8, 10, 12, 13]]

# wine_df[:, [0, 3, 6, 8, 10, 12, 13]]

# Should be using the drop method instead of del

wine_df.drop(wine_df.columns[[0, 3, 6, 8, 10, 12, 13]], axis=1, inplace=True)

# wine_df.columns[[0, 3, 6, 8, 10, 12, 13]]

In [27]:
len(wine_df.columns)

wine_df.head()

   14.23  1.71  15.6  127  3.06  2.29  1.04
0  13.20  1.78  11.2  100  2.76  1.28  1.05
1  13.16  2.36  18.6  101  3.24  2.81  1.03
2  14.37  1.95  16.8  113  3.49  2.18  0.86
3  13.24  2.59  21.0  118  2.69  1.82  1.04
4  14.20  1.76  15.2  112  3.39  1.97  1.05

### Step 5. Assign the columns as below:

The attributes are (dontated by Riccardo Leardi, riclea '@' anchem.unige.it):  
1) alcohol  
2) malic_acid  
3) alcalinity_of_ash  
4) magnesium  
5) flavanoids  
6) proanthocyanins  
7) hue

In [29]:
wine_df.columns = ['alc', 'malic', 'alcalinity', 'magne', 'flava', 'proanth', 'hue']

wine_df.head()

     alc  malic  alcalinity  magne  flava  proanth   hue
0  13.20   1.78        11.2    100   2.76     1.28  1.05
1  13.16   2.36        18.6    101   3.24     2.81  1.03
2  14.37   1.95        16.8    113   3.49     2.18  0.86
3  13.24   2.59        21.0    118   2.69     1.82  1.04
4  14.20   1.76        15.2    112   3.39     1.97  1.05

### Step 6. Set the values of the first 3 rows from alcohol as NaN

In [33]:
wine_df.loc[:2, 'alc'] = np.nan

### Step 7. Now set the value of the rows 3 and 4 of magnesium as NaN

In [37]:
wine_df.loc[2:3, 'magne'] = np.nan

### Step 8. Fill the value of NaN with the number 10 in alcohol and 100 in magnesium

In [39]:
wine_df.alc.fillna(10, inplace=True)
wine_df.magne.fillna(100, inplace=True)

wine_df.head()

     alc  malic  alcalinity  magne  flava  proanth   hue
0  10.00   1.78        11.2  100.0   2.76     1.28  1.05
1  10.00   2.36        18.6  101.0   3.24     2.81  1.03
2  10.00   1.95        16.8  100.0   3.49     2.18  0.86
3  13.24   2.59        21.0  100.0   2.69     1.82  1.04
4  14.20   1.76        15.2  112.0   3.39     1.97  1.05

### Step 9. Count the number of missing values

In [40]:
wine_df.isnull().sum()

alc           0
malic         0
alcalinity    0
magne         0
flava         0
proanth       0
hue           0
dtype: int64

### Step 10.  Create an array of 10 random numbers up until 10

In [49]:
arr = np.random.randint(0, high=10, size=10)

arr

array([3, 6, 2, 8, 4, 4, 4, 9, 0, 6])

### Step 11.  Set the rows of the random numbers in the column

### Step 12.  How many missing values do we have?

### Step 14. Print only the non-null values in alcohol

### Step 13. Delete the rows that contain missing values

### Step 15.  Reset the index, so it starts with 0 again

### BONUS: Create your own question and answer it.